import numpy as np

# https://rinsaka.com/python/numpy/04-06-pagerank.html
array = np.array([
    [0, 1/3, 0, 1/3, 1/3, 0],
    [1/3, 0, 1/3, 0, 0, 1/3],
    [0, 1, 0, 0, 0, 0],
    [1/2, 0, 0, 0, 1/2, 0],
    [0, 0, 0, 0, 0, 1],
    [1/3, 1/3, 0, 0, 1/3, 0]
]).T

# https://wayama.io/rec/pagerank/
# 5番目は手修正を加えている
array = np.array([
    [0, 1 / 3, 0, 1 / 3, 0, 1 / 3],
    [0, 0, 0, 1, 0, 0, ],
    [1 / 6, 1 / 6, 1 / 6, 1 / 6, 1 / 6, 1 / 6],
    [0, 0, 0, 0, 1 / 2, 1 / 2],
    [1 / 6, 1 / 6, 1 / 6, 1 / 6, 1 / 6, 1 / 6],
    [0, 0, 0, 1, 0, 0]
]).T